[
	{
		"headline": "Nick Chubb on Georgia football in 2018: ‘I think they can win it all'",
		"subhead": "",
		"author": "Connor Riley",
		"item_class": "story",
		"guid": "f21f6d26-aaaa-1111-8401-ed4dfe8ebc2c",
		"pub_date": "Mon, 30 Apr 2018 09:25:00 EDT",
		"summary": "With the NFL draft now in the rear-view mirror, it's safe to say that the decisions made by Nick Chubb, Sony Michel, Lorenzo Carter and Davin Bellamy to return for their senior seasons worked out for all parties involved. That's everyone, the players, the 2017 team and — according to Chubb — the future of the Georgia football program.",
		"full_text": "<p>With the NFL draft now in the rear-view mirror, it's safe to say that the decisions made by Nick Chubb, Sony Michel, Lorenzo Carter and Davin Bellamy to return for their senior seasons worked out for all parties involved. That's everyone, the players, the 2017 team and — according to Chubb — the future of the Georgia football program.</p><p>Had the four come out a year ago, there was certainly the chance that all four would've been drafted. But there's almost no chance they would go as high as they did. With Chubb and Michel and particular, that's almost certainly true, given that last year the only running backs taken in the top 35 were Leonard Fournette and Christian McCaffrey. With Dalvin Cook, Alvin Kamara and Kareem Hunt all having strong years, it showed that running backs might more valuable in today's NFL. Chubb was taken with the No. 35 pick and Michel was No. 31 in the 2018 NFL Draft.</p><p>As for the team benefiting, Georgia won the SEC with a freshman quarterback, beat the Heisman Trophy winner and the No. 1 overall draft pick in the Rose Bowl and went toe-to-toe with Alabama in the title game.</p><p>The team success obviously plays a part in Georgia football looking as healthy as it does. The four who returned were an integral part of last year's success. And when speaking with Chubb last week about his decision to return, he said that his decision to stay was also going to help everyone else in the program.</p><p>\"I thought it helped a lot, but not just for me,\" Chubb said on his decision to return to school. \"Just the big picture and showing guys that we can be a championship-caliber team and we're a team that'll continue to be good into the future.\"</p><p>To an extent, we've already seen a few players make the same decision that Chubb did and it will no doubt make the team better. Deandre Baker had an excellent 2017 season and was a big reason first-round draft pick Calvin Ridley had his lowest receiving output of the year in the national title game. Given his size and play, its safe to say he would've been picked, especially when some are mentioning him as a possible first-round pick in 2019. Much of the same can be said for wide receiver Terry Godwin, who made a number of huge catches throughout the season, most memorably his one-handed touchdown grab against Notre Dame.</p><p>Both came back and they'll help offset some of the losses that their respective position groups face, much how Chubb, Michel, Carter and Bellamy did the year before.</p><p>When asked to give a prediction on how Georgia would possibly fare without him next year, Chubb didn't downplay expectations that he help set.</p><p>\"I think they can win it all, they just have to get the job done. Definitely a lot better,\" Chubb said.</p><p>Georgia football won't be better without Chubb or Roquan Smith or Isaiah Wynn. But given what Georgia has returning in guys like Baker, Godwin, quarterback Jake Fromm and most of the offensive line, Chubb isn't too far off in saying that next year's team is a national title contender. A year ago, it did seem a little unrealistic to say that about the 2017 team.</p><p>But Chubb's final season showed that the infrastructure is there to be a championship team. And even though he won't play a snap for Georgia next year, Chubb and his now NFL bound teammates are a big reason that his Georgia fans can legitimately believe in winning a naitonal title.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/dawgnation/dawgnation01.jpg",
		"images": [
			{
				"path": "http://www.rtodd.net/swift/images/events/dawgnation/dawgnation01.jpg",
				"title": "Former Georgia running back Nick Chubb",
				"caption": "Former Georgia running back Nick Chubb expects big things out of the Bulldogs in 2018.",
				"credit": "Sean M. Haffrey/Getty Images"
			}
		],
		"locations": [
			{
				"latitude": 33.948005,
				"longitude": -83.377322,
				"name": "University of Georgia"
			}
		],
		"related_content": [
			{
				"headline": "Ben Barnes - British actor and singer",
				"summary": "In September 2006, Barnes was cast as Prince Caspian in The Chronicles of Narnia films Prince Caspian and The Voyage of the Dawn Treader. He has also played Tom Ward in the fantasy film Seventh Son, Dorian Gray in the 2009 adaptation of Oscar Wilde's The Picture of Dorian Gray, had supporting roles in The Words, and The Big Wedding, and portrayed Samuel Adams in the 2015 miniseries Sons of Liberty.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ben-barnes.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Ellen Page - Canadian actress",
				"summary": "In 2008, Page was one of 30 celebrities who participated in an online ad series for US Campaign for Burma, calling for an end to the military dictatorship in Burma. She describes herself as a pro-choice feminist.",
				"pub_date": "Fri, 01 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/ellen-page.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Nico Tortorella - American actor and model",
				"summary": "Speaking to the New York Post's Page Six in June 2016, Tortorella declared himself to be sexually fluid. He later identified as bisexual in an interview with Vulture on October 30, 2016. In November 2017 he talked about being in a polyamorous relationship, a revelation that has gotten him uninvited from his partner's family's Thanksgiving dinner.",
				"pub_date": "Fri, 06 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/nico-tortorella.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Gillian Anderson - American-British film, television and theatre actress, activist and writer",
				"summary": "Anderson resides with her three children in London, England, where she has lived since 2002. She has been in a relationship with screenwriter and dramatist Peter Morgan since 2016.",
				"pub_date": "Fri, 016 Mar 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/gillian-anderson.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Andy Mientus - American stage and television actor and singer",
				"summary": "On March 9, 2018 Amulet Books, an imprint of ABRAMS, announced that Mientus has written a middle-grade fiction series called The Backstagers",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/andy-mientus.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			},
			{
				"headline": "Jonathan Groff - American actor and singer",
				"summary": "Groff publicly came out as gay in October 2009 during the National Equality March in Washington.[29] From 2009 to 2010, Groff dated actor Gavin Creel.[30] From 2010 to 2013, Groff was in a relationship with actor Zachary Quinto.",
				"pub_date": "Fri, 06 Apr 2018 09:25:00 EDT",
				"lead_image": "http://www.rtodd.net/swift/images/events/personalities/jonathan-groff.jpg",
				"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c"
			}
		]
	}
]