[
	{
		"headline": "Steven Spielberg's Ready Player One improves immensely on the book",
		"author": "Tasha Robinson",
		"item_class": "review",
		"guid": "f21f6d26-2163-11e8-8401-ed4dfe8ebc2c",
		"pub_date": "Wed 14, 2018 12:33:00 EST",
		"full_text": "Steven Spielberg's new film adaptation of Ready Player One prominently features that same car, but in a context that improves it immensely. Spielberg doesn't have Wade talk audiences through it, and he doesn't spell out the references. He just slaps the car down in the middle of a tremendous early action scene, where it's prominent, distinctive, and memorable. Fans who want the full nostalgia trip, who want to wring every Easter egg out of the experience, will eventually be able to pause the movie and frame-by-frame through it, looking for the flux capacitor on the dashboard, checking the plates, and scanning for extra bonus material. But in the middle of the action, even to people who've never seen the Back to the Future movies and aren't vibing on the connection, the car doesn't need explaining. It's just a sleek piece of visual energy, one breathless element among dozens of others. It's not a citation or a list. It's an effortless, integrated piece of the action.",
		"lead_image": "http://www.rtodd.net/swift/images/events/ready-player-one.jpg"
	},
	{
		"headline": "Black Panther is the grown-up Marvel movie we've been waiting for",
		"author": "Bryan Bishop",
		"item_class": "review",
		"guid": "f21f6d26-aaaa-11e8-8401-ed4dfe8ebc2c",
		"pub_date": "Feb 14, 2018 12:33:00 EST",
		"full_text": "Throughout the history of its cinematic universe, Marvel Studios has excelled at creating engaging, entertaining diversions, bringing dozens of characters to life in a string of blockbusters that feed into one another, like a cinematic perpetual-motion machine. What it hasn't done is make movies that feel consequential. Sure, there was some commentary about war profiteering early on in the Iron Man films, and Captain America: The Winter Soldier glanced upon the idea of selling out privacy and freedom in the name of security. But more often than not, the studio's films are primarily concerned with keeping all the narrative plates spinning on the long march toward the Thanos showdown that will finally start in Avengers: Infinity War.",
		"lead_image": "http://www.rtodd.net/swift/images/events/black-panther.jpg"
	},
	{
		"headline": "Review: A Boy's Own Desire in ‘Call Me by Your Name'",
		"author": "Manohla Dargis",
		"item_class": "review",
		"guid": "f21f6d26-aaaa-1111-8401-ed4dfe8ebc2c",
		"pub_date": "Dec 14, 2017 12:33:00 EST",
		"full_text": "<p>You don't just watch Luca Guadagnino's movies, you swoon into them. His best-known titles, 'I Am Love' and 'A Bigger Splash,' feature beautiful people with impeccable taste experiencing haute-bourgeois life intensely. Passion and drama upend those lives, but what's most striking about these movies is their extraordinary palpable quality. In Mr. Guadagnino's work, passion and drama are expressed in words, deeds and surging music but also in the vibrant, visceral textures that envelop his characters - the cool marble, succulent fruit, shadow and light, sheens of sweat. These are movies that turn your gaze into near-touch, inviting you to see and almost caress their sun-warmed bodies.</p><p>Mr. Guadagnino's latest, 'Call Me by Your Name,' is another ravishment of the senses, though this time there's a strong narrative tethering all the churning feelings and sensuous surfaces. Like the 2007 novel by André Aciman on which it's based, the story turns on an affair between Elio Perlman (Timothée Chalamet), a coltish 17-year-old American-Italian, and Oliver (Armie Hammer), an American in his 20s. Elio lives with his father (a tremendous Michael Stuhlbarg) and mother (Amira Casar) in a villa in northern Italy. Each summer the father, a professor of Greco-Roman culture, invites a student to work with him and stay with his family; this year it's Oliver who moves in.</p><p>Elio and Oliver's affair begins slowly with each circling the other at a distance, conveying the kind of nonchalance that's a shield for interest. Oliver proves far better at this part of the game; he knows more than to look too long and too hard. Elio's furtive, ducking glances, by contrast, tend to linger, hovering in the air like questions. He's increasingly curious about this new guest, but soon inexplicably (to Elio, at least) irked by him as well, leading Elio to complain to his parents about Oliver's standard signoff ('later'). But when Elio scribbles a private rebuke in a notebook, chastising himself for responding harshly toward Oliver, it's as if he were writing an apologetic love letter.</p>",
		"lead_image": "http://www.rtodd.net/swift/images/events/call-me-by-your-name.jpg"
	},
	{
		"headline": "Have You Seen ‘A Wrinkle in Time'? Let's Talk.",
		"author": "Reggie Ugwu",
		"item_class": "review",
		"guid": "f21f6d26-aaaa-1111-8888-ed4dfe8ebc2c",
		"pub_date": "Mar 11, 2018 12:33:00 EST",
		"full_text": "More than 50 years since it first captured the hearts and expanded the minds of bookish young misfits, dreamers and in-betweeners around the world, “A Wrinkle in Time,” Madeleine L'Engle's 1962 coming-of-age-as-interdimensional-odyssey novel, has finally materialized in theaters. The director Ava DuVernay's adaptation, of a fantastical and cerebral story that many readers over the years had deemed unfilmable is one of the most anticipated movie events of the year – and one of the most polarizing.",
		"lead_image": "http://www.rtodd.net/swift/images/events/a-wrinkle-in-time.jpg"
	}
]